<?php

return array(

    'SIGNUP' => array(

        'success' => 'Вы зарегистрированы. Мы отправили на email ссылку для активации аккаунта.',
        'success_login' => 'Вы зарегистрированы. Мы отправили на email ссылку для активации аккаунта.<br>Чтобы подолжить работу перейдите в <a href="'.URL::to(AuthAccount::getStartPage()).'">Личный кабинет</a>',
        'email_exist' => 'Email уже зарегистрирован',
        'fail' => 'Неверно заполнены поля'
    ),

    'ACCOUNT_STATUS' => array(

        'active' => 'Ваш аккаунт активирован!',
        'blocked' => 'Ваш аккаунт заблокирован!',
        'not_active' => 'Ваш аккаунт не активирован!',
        'blocked_approve' => 'Ознакомительный период завершен.<br>Ваш аккаунт заблокирован!',
    ),

    'PASSWORD_RESTORE' => array(
        'success' => 'На указанный Email выслано письмо с инструкцией по сбросу пароля.',
        'fail' => 'Указанный Email не зарегистрирован!',
        'fail_send' => 'Возникла ошибка при отправке Email!',
    ),
    'PASSWORD_RESET' => array(
        'success' => 'Пароль сброшен. Можете авторизоваться подновым паролем.',
        'fail' => 'Сброс невозможен. Указанный Email не определен!',
        'fail_token' => 'Неверный Token!',
    ),

);