<?php

return array(

    'SIGNUP' => array(

        'success' => 'Вы зарегистрированы. Мы отправили на email ссылку для активации аккаунта.',
        'success_login' => 'Вы зарегистрированы. Мы отправили на email ссылку для активации аккаунта.<br>Что бы подолжить работу перейдите в <a href="'.URL::to(AuthAccount::getStartPage()).'">Личный кабинет</a>',
        'email_exist' => 'Email уже зарегистрирован',
        'fail' => 'Неверно заполнены поля'
    ),

    'ACCOUNT_STATUS' => array(

        'active' => 'Ваш аккаунт активирован!',
        'blocked' => 'Ваш аккаунт заблокирован!',
        'not_active' => 'Ваш аккаунт не активирован!',
        'blocked_approve' => 'Ознакомительный период завершен. Ваш аккаунт заблокирован!',
    )

);